{
  "Title":"Syllabus",
  "Year":2015,
  "Released on":"01-07-2015",
  "Semester":"1 & 2",
  "syllabus":[
    {"Subject":"Calculaus","code":"MA 101","LTP":"3-1-0-4","Course Objectives":"In this course the students are introduced to some basic tools in Mathematics which are useful in modelling and analysing physical phenomena involving continuous changes of variables or parameters. The differential and integral calculus of functions of one or more variables and of vector functions taught in this course have applications across all branches of engineering. This course will also provide basic training in plotting and visualising graphs of functions and intuitively understanding their properties using appropriate software packages.","index":"Single Variable Calculus and Infinite series, Three dimensional space and functions of more than one variable, Partial derivatives and its applications, Calculus of vector valued functions, Multiple Integrals, Vector Integration.","Expected outcome":"At the end of the course the student will be able to model physical phenomena involving continuous changes of variables and parameters and will also have acquired basic training in visualising graphs and surfaces using software or otherwise.","Text Book":["Anton, Bivens and Davis, Calculus, John Wiley and Sons.","Pal, S. and Bhunia, S. C., Engineering Mathematics, Oxford University Press, 2015.","Thomas Jr., G. B., Weir, M. D. and Hass, J. R., Thomas’ Calculus, Pearson."],"References":["Bali, N. P. and Goyal, M., Engineering Mathematics, Lakshmy Publications.","Grewal, B. S., Higher Engineering Mathematics, Khanna Publishers, New Delhi.","Jordan, D. W. and Smith, P., Mathematical Techniques, Oxford University Press.","Kreyszig, E., Advanced Engineering Mathematics, Wiley India edition.","Sengar and Singh, Advanced Calculus, Cengage Learning.","Srivastava, A. C. and Srivasthava, P. K., Engineering Mathematics Vol. 1, PHI Learning Pvt. Ltd."],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"Introduction: Hyperbolic functions and inverses-derivatives and integrals.","hours":3},{"content":"Basic ideas of infinite series and convergence. Convergence tests-comparison, ratio, root tests (without proof). Absolute convergence. Maclaurins series-Taylor series - radius of convergence.","hours":3},{"content":" ( For practice and submission as assignment only:Sketching, plotting and interpretation of exponential,logarithmic and hyperbolic functions using suitable software. Demonstration of convergence of series by software packages)","hours":3}]},{"module":2,"mark percentage":15,"contents":[{"content":"Three dimensional space; Quadric surfaces, Rectangular,Cylindrical and spherical coordinates, Relation between coordinate systems. Equation of surfaces in cylindrical and spherical coordinate systems.","hours":4},{"content":"Functions of two or more variables – graphs of functions of two variables- level curves and surfaces –Limits and continuity.","hours":2},{"content":"(For practice and submission as assignment only:Tracing of surfaces- graphing quadric surfaces- graphing functions of two variables using software packages)","hours":2}]},{"module":3,"mark percentage":15,"contents":[{"content":"Partial derivatives - Partial derivatives of functions of more than two variables - higher order partial derivatives- differentiability, differentials and local linearity.","hours":4},{"content":"The chain rule - Maxima and Minima of functions of two variables - extreme value theorem (without proof)-relative extrema."}]},{"module":4,"mark percentage":15,"contents":[{"content":"Introduction to vector valued functions - parametric curves in 3-space. Limits and continuity - derivatives -tangent lines - derivative of dot and cross product-definite integrals of vector valued functions.","hours":2},{"content":"Change of parameter - arc length - unit tangent - normal- velocity - acceleration and speed - Normal and tangential components of acceleration.","hours":2},{"content":"Directional derivatives and gradients-tangent planes and normal vectors.","hours":2},{"content":"(For practice and submission as assignment only:Graphing parametric curves and surfaces using software packages)","hours":4}]},{"module":5,"mark percentage":20,"contents":[{"content":"Double integrals - Evaluation of double integrals - Double integrals in non-rectangular coordinates - reversing the order of integration.","hours":3},{"content":"Area calculated as double integral - Double integrals in polar coordinates.","hours":2},{"content":"Triple integrals - volume calculated as a triple integral - triple integrals in cylindrical and spherical coordinates.","hours":2},{"content":"Converting triple integrals from rectangular to cylindrical coordinates - converting triple integrals from rectangular to spherical coordinates -change of variables in multiple integrals - Jacobians (applications of results only)","hours":3}]},{"module":6,"mark percentage":20,"contents":[{"content":"Vector and scalar fields- Gradient fields – conservative fields and potential functions – divergence and curl - the ∇ operator - the Laplacian ∇^2","hours":3},{"content":"Line integrals - work as a line integral- independence of path-conservative vector field.","hours":3},{"content":"Green’s Theorem (without proof- only for simply connected region in plane), surface integrals – Divergence Theorem (without proof) , Stokes’ Theorem (without proof) (For practice and submission as assignment only: graphical representation of vector fields using software packages)Green’s Theorem (without proof- only for simply connected region in plane), surface integrals – flux integral - Divergence Theorem (without proof) , Stokes’ Theorem (without proof) (For practice and submission as assignment only:graphical representation of vector fields using software packages )","hours":4}]}
    ]},
    {"Subject":"Engineering Chemistry","code":"CY 100","LTP":"3-1-0-4","Course Objectives":"To enable the students to acquire knowledge in the concepts of chemistry for engineering applications and to familiarize the  students with different application oriented topics like new  generation engineering materials, storage devices, different instrumental methods etc. And to develop abilities and skills that are relevant to the study and practice of chemistry. ","index":"Spectroscopy - Principles and Applications, Electrochemistry - Electrodes, Electrochemical series and applications, Nernst Equation, Potentiometric titration and application, Cells, Instrumental Methods-Thermal Analysis, Chromatography;  Conductivity, Chemistry of Engineering Materials, Copolymers, Conducting Polymers, Advanced Polymers, Nano materials, Fuels and Calorific value;Lubricants and their  properties, Water Technology-Hardnes, Water softening methods,Sewage water Treatment.","Expected outcome":"The student will be able to apply the knowledge  of chemistry  and will be equipped  to take up chemistry related topics as part of their project works during higher semester of the course.","References":["Ahad,J., Engineering Chemistry, Jai Publications ","Dara, S.S., Engineering Chemistry, S Chand Publishers","Fernandez, A., Engineering Chemistry, Owl Book Publishers, ISBN 9788192863382 ","Jain and Jain, Engineering Chemistry, Dhanpat Rai Publishers ","Kaurav, Engineering Chemistry with Laboratory Experiments. PHI, ISBN 9788120341746 ","Manjooran K. S., Modern Engineering Chemistry, Kannatheri Publication ","Seymour, R. B., Introduction to Polymer Chemistry, McGraw Hill ","Rath, P., Engineering Chemistry, Cengage Learning, ISBN 9788131526699","Wiley India, Engineering Chemistry, ISBN 9788126543205"],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"Spectroscopy: Introduction, Beer Lamberts Law (worked out examples) ","hours":1},{"content":"UV-visible spectroscopy - Principle, Instrumentation and applications ","hours":2},{"content":"IR spectroscopy - Principle and applications ","hours":2},{"content":"H NMR spectroscopy - Principle, chemical shift - spin - spin splitting and applications including MRI","hours":4}]},{"module":2,"mark percentage":15,"contents":[{"content":"Electrochemistry Different types of electrodes (general)  – SHE, Calomel electrode, Glass electrode and determination of E0 using SHE & Calomel electrode ","hours":2},{"content":"Electrochemical series and its applications.","hours":1},{"content":"Nernst equation for an electrode- Derivation, application & numericals ","hours":2},{"content":"Potentiometric titration - Acid-base and redox titration","hours":2},{"content":"Lithium ion cell and Fuel cell.","hours":1}]},{"module":3,"mark percentage":15,"contents":[{"content":"Instrumental  Methods:  Thermal  analysis  -  Principle,instrumentation and applications of TGA and DTA.","hours":3},{"content":"Chromatographic methods - Basic principles, column,TLC. Instrumentation and principles of GC and HPLC.","hours":4},{"content":"Conductivity - Measurement of conductivity ","hours":1}]},{"module":4,"mark percentage":15,"contents":[{"content":"Chemistry of Engineering Materials: Copolymers - BS, ABS - Structure and Properties.","hours":1},{"content":"Conducting Polymers - Polyaniline, Polypyrrole -Preparation, Structure and Properties.","hours":2},{"content":"OLED – An introduction","hours":1},{"content":"Advanced  Polymers  –  Kevlar,  Polybutadiene rubber and silicone rubber: Preparation, Structure and Properties.","hours":2},{"content":"Nanomaterials – Definition, Classification, chemical methods of preparation - hydrolysis and reduction ","hours":2},{"content":"Properties and Applications – Carbon Nano Tubes and fullerenes.","hours":1}]},{"module":5,"mark percentage":20,"contents":[{"content":"Fuels  and  Lubricants:  Fuels  -  Calorific  Value, HCV and  LCV  - Determination of  calorific value of a  solid and liquid  fuel  by  Bomb calorimeter - Dulongs formula and Numericals.","hours":3},{"content":"Liquid fuel - Petrol and Diesel - Octane number & Cetane number","hours":1},{"content":"Biodiesel - Natural gas.","hours":2},{"content":"Lubricant - Introduction, solid, semisolid and liquid lubricants.","hours":1},{"content":"Properties  of  lubricants  - Viscosity  Index,  Flash  point,  Fire  point,  Cloud point, Pour point and Aniline point.","hours":2}]},{"module":6,"mark percentage":20,"contents":[{"content":"Water  Technology:  Types  of  hardness,  Units  of  hardness,  Estimation  of Hardness – EDTA method.  Numericals based on the above ","hours":3},{"content":"Water softening methods - Ion exchange process - Principle. Polymer ion exchange.","hours":2},{"content":"Reverse Osmosis - Disinfection method by chlorination and UV","hours":1},{"content":"Dissolved oxygen, BOD and COD.","hours":2},{"content":"Sewage water Treatment - Trickling Filter and UASB process.","hours":1}]}]
    
      
    },
    {"Subject":"Engineering Physics","code":"PH 100","LTP":"3-1-0-4","Course Objectives":"Most of the engineering disciplines are rooted in Physics.In fact a good engineer is more or less an applied physicist.This course is designed to provide a bridge to the world of technology from the basics of science and to equip the students with skills in scientific inquiry,problem solving,and laboratory techniques.","index":"Harmonic Oscillations:  Damped and Forced Harmonic Oscillations. Waves: One Dimensional and Three Dimensional waves, Interference:Interference in thin films(Reflected system)  Diffraction: Fraunhofer and Fresnel Diffraction, Grating, Polarization of Light: Double refraction, production and detection of polarized light, Superconductivity: Properties and Applications. Quantum  Mechanics: Schrodinger Equations- Formulation and Solution, Operators, Applications. Statistical Mechanics: Microstates and macro states Maxwell - Boltzmann, Bose-Einstein and Fermi Dirac statistics.Fermi level and its significance. Acoustics: Intensity of sound, Reverberation and design concepts, Ultrasonics: Production, Detection and Applications, NDT methods, Lasers: Properties,  Working Principles, Practical Lasers. Photonics: Basics of Solid State lighting, Photo detectors, Solar Cells,Fiber Optics.","Expected outcome":"Familiarity with the principles of Physics and its significance in engineering systems and technological advances.","References":["Aruldhas, G., Engineering Physics, PHI Ltd.","Beiser, A., Concepts of Modern Physics, McGraw Hill India Ltd.","Bhattacharya and Tandon, Engineering Physics , Oxford India.","Brijlal and Subramanyam, A Text Book of Optics, S.Chand & Co.","Dominic and Nahari, A Text Book of Engineering Physics, Owl Books Publishers.","Hecht, E., Optics, Pearson Education.","Mehta, N., Applied Physics for Engineers, PHI Ltd","Palais, J. C., Fiber Optic Communications, Pearson Education.","Pandey, B. K. and  Chathurvedi, S., Engineering Physics, Cengage Learning.","Philip, J., A Text Book of Engineering Physics, Educational Publishers","Premlet, B., Engineering Physics, Mc GrawHill India Ltd.","Sarin, A.  and Rewal, A., Engineering Physics, Wiley India Pvt Ltd.","Sears and Zemansky, University Physics , Pearson.","Vasudeva, A. S., A Text Book of Engineering Physics,S. Chand & Co."],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"Harmonic  Oscillations:  Differential equation of damped  harmonic oscillation, forced harmonic oscillation and their solutions- Resonance, Q factor, Sharpness of resonance- LCR circuit as an electrical analogue of Mechanical Oscillator (Qualitative) ","hours":5},{"content":"Waves: One dimensional wave - differential equation and solution. Three dimensional waves-Differential equation & its solution.(No derivation)Transverse vibrations of a stretched string.","hours":4}]},{"module":2,"mark percentage":15,"contents":[{"content":"Interference: Coherence. Interference in thin films and wedge shaped films (Reflected system) Newton’s  rings-measurement  of  wavelength  and refractive index of liquid Interference filters. Antireflection coating. ","hours":5},{"content":"Diffraction Fresnel and Fraunhofer diffractio. Fraunhofer diffraction at a single slit. Plane transmission grating. Grating equation - measurment of wavelength. Rayleigh’s criterion  for  resolution  of grating-  Resolving power and dispersive power of grating. ","hours":4}]},{"module":3,"mark percentage":15,"contents":[{"content":"Polarization of  Light: Types of polarized light. Double refraction. Nicol Prism. Quarter wave plate and half wave plate. Production and detection of circularly and elliptically polarized light. Induced birefringence- Kerr Cell - Polaroid & applications.","hours":4},{"content":"Superconductivity: Superconducting phenomena. Meissner effect. Type-I and Type-II superconductors. BCS theory (qualitative). High temperature superconductors - Josephson Junction- SQUID- Applications  of superconductors"}]},{"module":4,"mark percentage":15,"contents":[{"content":"Quantum  Mechanics: Uncertainty  principle  and  its  applications- formulation  of Time dependent and Time independent Schrödinger equations- physical meaning of wave function- Energy and  momentum Operators-Eigen  values  and  functions- One dimensional infinite square well potential .Quantum mechanical Tunnelling (Qualitative)","hours":6},{"content":"Statistical  Mechanics:  Macrostates  and  Microstates.Phase space. Basic postulates of Maxwell- Boltzmann, Bose-Einstein and Fermi  Dirac statistics. Distribution equations in the three cases(no derivation). Fermi Level and its significance.","hours":3}]},{"module":5,"mark percentage":20,"contents":[{"content":"Acoustics: Intensity of sound- Loudness-Absorption coefficient  - Reverberation and reverberation time- Significance of reverberation time- Sabine’s formula (No derivation) -Factors affecting acoustics of a building.","hours":4},{"content":"Ultrasonics: Production of ultrasonic waves - Magnetostriction effect and Piezoelectric  effect  - Magnetostriction oscillator and  Piezoelectric oscillator - Detection of ultrasonics - Thermal and piezoelectric methods- Applications of ultrasonics - NDT and medical."}]},{"module":6,"mark percentage":20,"contents":[{"content":"Laser:  Properties  of  Lasers,  absorption,  spontaneous and stimulated emissions, Population inversion, Einstein’s coefficients, Working principle of laser,Optial resonant cavity. Ruby Laser, Helium-Neon  Laser, Semiconductor Laser  (qualitative). Applications of laser, holography (Recording and reconstruction)","hours":5},{"content":"Photonics: Basics of  solid state lighting - LED – Photodetectors - photo voltaic cell, junction & avalanche photo diodes, photo transistors, thermal detectors, Solar cells- I-V characteristics - Optic fibre-Principle  of propagation-numerical  aperture-optic communication system  (block diagram)  -  Industrial,  medical  and  technological  applications  of  optical fibre.  Fibre  optic  sensors  -  Basics  of  Intensity  modulated  and  phase modulated sensors.","hours":5}]}]
    
      
    },
    {"Subject":"Engineering Mechanics","code":"BE 100","LTP":"3-1-0-4","Course Objectives":"1.To apply the principles of mechanics to practical engineering problems.2.To identify appropriate structural system for studying a given problem and isolate it from its environment.3.To develop simple mathematical model for engineering problems and carry out static analysis. 4.To carry out kinematic and kinetic analyses for particles and systems of particles. ","index":"Statics: Fundamental concepts and laws of mechanics;Force systems;Principle of moments; Resultant of force and couple systems;Equilibrium of rigid body; Free body diagram; Equilibrium of a rigid body in three dimension; Support reactions;Properties of surfaces and solids - Centroid, Moment of inertia, Polar moment of inertia, Mass moment of inertia, Product of inertia and Principal moment of inertia; Theorems of Pappus – Guldinus; Friction; Principle of virtual work. Dynamics: Rectangular  and  cylindrical  coordinate  system; Combined motion of rotation and translation; Newton’s second law in rectilinear translation; D’Alembert’s principle; Mechanical vibration; Simple harmonic motion; Spring-mass model.","Expected outcome":"1.Students will be able to apply and demonstrate the concepts of mechanics to practical engineering problems.2. Students will be able to determine the properties of planes and solids.3.Students will be able to apply fundamental concepts of dynamics to practical problems.","Text Book":["Shames, I. H., Engineering Mechanics - Statics and Dynamics, Pearson Prentice ","Timoshenko, S. & Young D. H., Engineering Mechanics, McGraw Hill"],"References":["Babu,j.,Engineering Mechanics, Pearson Prentice Hall ","Beer and Johnson, Vector Mechanics for Engineers - Statics and Dynamics, Tata McGraw Hill Publishing Company Limited ","Benjamin J., Engineering Mechanics, Pentex Book Publishers and Distributors","Bhavikkatti, S. S., Engineering Mechanics, New Age International Publishers ","Hibbeler, R. C., Engineering Mechanics: Statics and Dynamics. Pearson Prentice Hall","Kumar, K. L., Engineering Mechanics, Tata McGraw Hill Publishing Company Limited","Merriam J. L. and Kraige L. G., Engineering Mechanics – Vol. I and II, John Wiley","Rajasekaran  S.  and  Sankarasubramanian,G., Engineering  Mechanics, Vikas Publishing House Private Limited","Tayal, A. K.,Engineering Mechanics- Statics and Dynamics, Umesh Publications"],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"Statics: Fundamental concepts and laws of mechanics–  Rigid  body  – Principle of transmissibility of forces ","hours":2},{"content":"Coplanar force systems - Moment of a force – Principle of moments ","hours":2},{"content":"Resultant of force and couple system","hours":4},{"content":"Equilibrium of rigid body – Free body diagram – Conditions of equilibrium in two dimensions – Two force and three force members.","hours":3}]},{"module":2,"mark percentage":15,"contents":[{"content":"Types of supports – Problems  involving point loads and uniformly distributed loads only. ","hours":5},{"content":"Force  systems in space – Degrees of freedom – Free body diagram – Equations of equilibrium – Simple resultant and Equilibrium problems.","hours":4}]},{"module":3,"mark percentage":15,"contents":[{"content":"roperties of planar  surfaces – Centroid and second moment of area (Derivations not required) - Parallel and perpendicular axis theorem – Centroid and Moment of Inertia of composite area. ","hours":3},{"content":"Polar Moment of Inertia – Radius of gyration – Massmoment of inertia of cylinder and thin disc (No derivations required)","hours":2},{"content":"Product of inertia – Principal Moment of Inertia (conceptual level).","hours":3},{"content":"Theorems of Pappus and Guldinus. ","hours":1}]},{"module":4,"mark percentage":15,"contents":[{"content":"Friction – Characteristics of dry friction – Problems involving friction of ladder, wedges and connected bodies.","hours":6},{"content":"Definition of work and virtual work –  Principle of virtual work for a system of connection bodies – Problems on determinate beams only.","hours":4}]},{"module":5,"mark percentage":20,"contents":[{"content":"Dynamics: Rectangular and Cylindrical co-ordinate system ","hours":1},{"content":"Combined motion of rotation and translation – Concept of instantaneous centre – Motion of connecting rod of piston and crank of a reciprocating pump.","hours":4},{"content":"Rectilinear translation – Newton’s second law – D’Alembert’s Principle – Application to connected bodies (Problems on motion of lift only).","hours":4}]},{"module":6,"mark percentage":20,"contents":[{"content":"Mechanical vibrations – Free and forced vibration - Degree of freedom","hours":1},{"content":"Simple harmonic motion – Sprin -mass model – Period – Stiffness – Frequency – Simple numerical problems of single degree of freedom. ","hours":7}]}
    ]},
    {"Subject":"Engineering Graphics","code":"BE110","LTP":"1-1-2-3","Course Objectives":"To enable the  student to be able to effectively communicate  basic designs through graphical representations as per standards.","index":"Introduction to Engineering Graphics; Orthographic projections of lines and solids, Isometric projection, Freehand sketching, Introduction to CAD,Sections of solids, Development of surfaces, Perspective projection.","Expected outcome":"Upon successful completion of this course, the student would  have accomplished the following abilities and skills: 1.Fundamental Engineering Drawing Standards. 2.Dimensioning and preparation of neat drawings and drawing sheets. 3. Interpretation of engineering drawings.4.The features of CADD software ","References":["Agrawal, B. and Agrawal, C. M., Engineering Drawing, Tata McGraw Hill Publishers","Anilkumar, K. N., Engineering Graphics, Adhyuth Narayan Publishers ","Benjamin, J., Engineering Graphics, Pentex Publishers","Bhatt, N., D., Engineering Drawing, Charotar Publishing House Pvt Ltd. ","Duff, J. M. and Ross, W. A., Engineering Design and Visualization, Cengage Learning,2009 ","John, K. C., Engineering Graphics, Prentice Hall India Publishers","Kulkarni, D. M., Rastogi, A. P. and Sarkar, A. K.,Engineering Graphics with AutoCAD, PHI 2009 ","Luzadder, W. J. and Duff, J. M., Fundamentals of Engineering Drawing, PHI 1993 ","Parthasarathy, N. S., and Murali, V., Engineering Drawing, Oxford University Press ","Varghese, P. I., Engineering Graphics, V I P Publishers","Venugopal, K., Engineering Drawing & Graphics, New Age International Publishers "],"modules":[{"module":1,"mark percentage":20,"contents":[{"content":"6 exercises Introduction to Engineering Graphics: Need for  engineering drawing.Drawing instruments; BIS  code of practice for general engineering drawing. Orthographic  projections  of  points  and  lines:-Projections of points in different quadrants; Projections of straight lines inclined to one of the reference planes, straight lines inclined to both the planes; True length and inclination of lines with reference planes; Traces of lines.","hours":10}]},{"module":2,"mark percentage":20,"contents":[{"content":"12 exercises Orthographic projections of solids:-Projections of simple solids* in simple positions, projections of solids with axis inclined to one of the reference planes and axis inclined to both the reference planes.","hours":9}]},{"module":3,"mark percentage":20,"contents":[{"content":"12 exercises.Isometric  Projections:-Isometric  projections and views of plane figures simple* and truncated simple* solids in simple position including sphere and hemisphere and their combinations. Freehand sketching: Freehand  sketching of real objects, conversion of pictorial views into orthographic views and vice versa.","hours":7}]},{"module":4,"mark percentage":"Internal","contents":[{"content":"6 exercises Introduction to Computer Aided Drafting - familiarizing various coordinate systems and commands used in any standard drafting software - drawing of lines, circle, polygon, arc, ellipse, etc. Creating 2D drawing. Transformations: move, copy, rotate, scale, mirror,offset and array; trim, extend, fillet, chamfer. Dimensioning and text editing. Exercises on basic drafting  principles, to  create  technical  drawings. Create orthographic views of simple solids from pictorial views. Create isometric views of simple solids from orthographic views. Solid modelling and sectioning of solids, extraction of 2D drawings from solid models. (For  internal examination only, not for University Examination).","hours":14}]},{"module":5,"mark percentage":"20","contents":[{"content":"9 exercises. Sections  and developments of solids: -Sections of simple* solids in simple vertical positions with section plane inclined to one of the reference planes - True shapes of sections. Developments of surfaces of these solids ","hours":10}]},{"module":6,"mark percentage":20,"contents":[{"content":"6 exercises Intersection of surfaces: - Intersection of prism in prism and cylinder in cylinder - axis bisecting at right  angles only. Perspective  projections: - perspective projections of simple* solids. ","hours":6}]}
    ]},
    {"Subject":"Introduction to Civil Engineering","code":"BE101-01","LTP":"2-1-0-3","Course Objectives":"1.To provide the students an overview of the profession of Civil Engineering. 2.To give the students an illustration of the use and properties of various building materials and explain the building construction aspects.","index":"Civil Engineering as a profession; General introduction to history of Civil Engineering; types and classification  of  buildings; setting out of a building;    Building materials - Stones, Bricks, Tiles, Cement, Aggregate, Cement mortar, Timber, Steel; Building Construction - Stone Masonry, Brick Masonry, Floors and flooring, Roofs and roof coverings.","Expected outcome":"1.Students will be able to explain the importance of Civil Engineering in the infrastructural development of the society. 2.They will be able to illustrate the types, uses and properties of various building materials. 3.Students will be able to explain the method of construction of different components of a building.","References":["Chen, W. F. and Liew, J. Y. R., (Eds.), The Civil Engineering Handbook, Second Edition, CRC Press (Taylor and Francis) ","Dalal, K. R., Essentials of Civil Engineering, Charotar Publishing House ","Jordan, D. W. and Smith, P., Mathematical Techniques, Oxford University Press.","Gopi, S., Basic Civil Engineering, Pearson Publishers","Kandya, A. A., Elements of Civil Engineering, Charotar Publishing house ","Mamlouk, M. S. and Zaniewski,J. P., Materials for Civil and Construction Engineering, Pearson Publishers. ","McKay, W. B. and McKay, J. K., Building Construction Volumes 1 to 4, Pearson India Education Services","Rangwala, S. C. and Dalal, K. B., Engineering Materials, Charotar Publishing house","Rangwala, S. C. and Dalal, K. B., Building Construction, Charotar Publishing house "],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"General  introduction  to  Civil  Engineering - History of Civil Engineering -  Relevance  of  Civil  Engineering  in  the overall infrastructural development of the country.  ","hours":2},{"content":"Types and  classification of structures - buildings,towers, chimneys, bridges, dams, retaining walls, water tanks, silos, roads, railways,runways and pipelines (Brief description only)","hours":3},{"content":"Definition and types of buildings  as per National Building Code of India (brief description only). ","hours":1},{"content":"Selection of site - Components of a building  and their functions - Setting out of a building.  ","hours":2}]},{"module":2,"mark percentage":15,"contents":[{"content":"Stones: Classification of stones - Qualities of good building stones - Quarrying - Dressing - Tests - Specifications  Uses of common building stones.","hours":2},{"content":"Bricks: Composition of good brick earth - Classification - Qualities of good bricks - Field and laboratory tests - Specifications. ","hours":2},{"content":"Tiles: Classification - Manufacture - Properties - Tests - Specification","hours":3}]},{"module":3,"mark percentage":15,"contents":[{"content":"Cement: Basic Ingredients – Manufacturing  process -Grades - Properties - Tests - Specifications.","hours":4},{"content":"Aggregates: Fine and coarse aggregate - Properties - Uses - Test","hours":3},{"content":"Cement Mortar: Types and preparation.","hours":1}]},{"module":4,"mark percentage":15,"contents":[{"content":"Stone Masonry: Types - Details of Ashlar, Random Rubble, Coarse Rubble and Dry Rubble Masonry.","hours":3},{"content":"Brick Masonry: Types - Bond - Introduction to all types of bonds - English bond in detail (1, 1½ and 2 brick walls) - Comparison of stone and brick masonry.","hours":4}]},{"module":5,"mark percentage":20,"contents":[{"content":"Timber:  Properties - Uses - Classification - Seasoning  - Defects - Preservation - Tests; Hard board and Particle board- Manufacture and use.","hours":3},{"content":"Steel: Structural steel and steel as reinforcement - Types - Properties - Uses - Market forms. ","hours":3}]},{"module":6,"mark percentage":20,"contents":[{"content":"Floors and Flooring materials: Different types and selection of floors and floor coverings.","hours":3},{"content":"Roofs and roof coverings: Different types of roofs - Suitability - Types and selection of roofing materials.","hours":3}]}
    ]},
    
    {"Subject":"Introduction to Mechanical Engineering Sciences","code":"BE101-02","LTP":"2-1-0-3","Course Objectives":"1.To introduce different disciplines of Mechanical Engineering 2.To kindle interest in Mechanical Engineering 3.To impart basic mechanical engineering principles ","index":"Thermodynamics & Power sources,Thermal Engineering, Refrigeration and Air  Conditionin, Automobile & Aeronautical Engineering,Mechanisms &Machines, Materials and manufacturing.","Expected outcome":"At the end of the course, the students will have exposed to the different areas of Mechanical Engineering; gained idea about nature, scope and applications of Mechanical Engineering principles. ","References":["Dossat, R J., Principles of Refrigeration, PHI ","Heywood, J., Internal Combustion Engine Fundamentals, McGraw Hill Publishers ","Holman, J. P., Thermodynamics, McGraw Hill Co.","Jain, K. K. and Asthana, R. B., Automobile Engineering, TTTI Bhopal  ","Kalpakjian, S. and Schmid, S. R.,Manufacturing Processes for Engineering Materials, Pearson education ","Maines, R., Landmarks in Mechanical Engineering, ASME","Menon, R. V. G., The Development of Science & Technology.","Peng, W. W., Principles of Turbomachinery, John Wiley & Sons ","Pita, E. G., Air Conditioning Principles & Systems,PHI ","Shigley, J. E. and Uicker, J. J., Theory of Machines & Mechanisms, Oxford University Press ","Shigley, J. E., Mechanical Engineering Design, McGraw Hill Publishers ","Spalding, D. B. and Cole, E. H., Engineering Thermodynamics, ELBS & Edward Arnold (Pub) Ltd. ","Stone, R. and Ball, T. K., Automotive Engineering Fundamentals, SAE International ","Sutton, G. P. and Ross, D. M., Rocket Propulsion Elements, John Wiley & Sons","Von Karman, T., Aerodynamics: Selected Topics in the Light of Their Historical Development, Courier Corporation ","Online course on Refrigeration & Air conditioning, IIT Kharagpur www.nptel.ac.in" ],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"Thermodynamics: Nature and scope of thermodynamics; Basic concepts ; Laws of thermodynamics- Discovery, Significance  & Applications; Qualitative ideas on Entropy, Available energy, Irreversibility, Clausius Inequality, Principle of increase of entropy & Carnot engine; Limitations of Thermodynamics;  Sources of power; history of power production; power production in the future.","hours":7}]},{"module":2,"mark percentage":15,"contents":[{"content":"Thermal  Engineering: Historical development of steam engine, steam turbines,   gas turbine and hydraulic turbines; Principle   of turbomachinery; History of IC engines; two  stroke and four stroke engines-working,  applications; Air compressors- types and uses;  Principles of Rocket propulsion, chemical  rockets, Indian space programme ","hours":7}]},{"module":3,"mark percentage":15,"contents":[{"content":"Refrigeration & Air Conditioning: History & scope of refrigeration; applications  of refrigeration; Food preservation, refrigerated storage;applications in chemical and process industries; special applications; Air conditioning- Principles & systems; scope  of air conditioning; Components of A/c systems,all-air and all-water A/c system;,Psychrometric properties of air; Human comfort;comfort standards.","hours":7}]},{"module":4,"mark percentage":20,"contents":[{"content":"","hours":3},{"content":"Area calculated as double integral - Double integrals in polar coordinates.","hours":2},{"content":"Triple integrals - volume calculated as a triple integral - triple integrals in cylindrical and spherical coordinates.","hours":2},{"content":"Converting triple integrals from rectangular to cylindrical coordinates - converting triple Automobile & Aeronautical Engineering: Introduction to an Automobile; history of the automobile; Indian  Automobiles; Types of automobiles; Layout of an automobile; Major components and their functions; Manufacturers of motor vehicles in India; Fundamentals of aerodynamics; theory of lift and drag;aircraft engines-types and applications. integrals from rectangular to spherical coordinates -change of variables in multiple integrals - Jacobians (applications of results only)","hours":7}]},{"module":5,"mark percentage":20,"contents":[{"content":"Mechanisms & Machines:Introduction; Analysis and synthesis; terminology; definitions &  assumptions; planar, spherical and spatial mechanisms, examples of mechanisms; mobility;  classification of mechanisms; Grashof’s law;  mechanical advantage: Mechanical Engineering design; types of design; design considerations; types of loads;factor of safety; codes & standards; economics of design; reliability; safety","hours":7}]},{"module":6,"mark percentage":20,"contents":[{"content":"Manufacturing  Engineering  &  Materials: Introduction and history of materials and  manufacturing; engineering materials; metals,  alloys, composites, microstructures, heat  treatment, physical properties of materials and  material testing; methods of manufacturing;    examples of manufactured products; Computer  Integrated manufacturing; lean production &  agile manufacturing; environmentally conscious  design & manufacturing; organization for manufacture. ","hours":7}]}
    ]},
    {"Subject":"Introduction to Electrical Engineering","code":"BE101-03","LTP":"2-1-0-3","Course Objectives":"The objective of this course is to set a firm and solid foundation in Electrical Engineering with strong analytical skills and conceptual understanding of basic laws and analysis methods in electrical and magnetic circuits.","index":"Fundamental Concepts of Circuit Elements and Circuit variables, Real and Ideal independent voltage and current sources, V-I relations; Basic Circuit Laws, Analysis of resistive circuits,  Magnetic Circuits, Electromagnetic Induction;  Alternating current fundamentals, Phasor  Concepts, Complex epresentation, Phasor analysis of RL, RC, RLC circuit, admittances; Complex Power, Resonance in series and parallel circuits; Three-phase systems, analysis of balanced and unbalanced star and delta connected loads; Wiring systems, Earthing, Protective device","Expected outcome":"The course will enable students to learn advanced topics in Electrical Engineering. ","References":["Bhattacharya, S. K., Basic Electrical & Electronics Engineering, Pearson ","Bird, J., Electrical Circuit Theory and Technology, Routledge, Taylor & Francis Group","Edminister, J., Electric Circuits, Schaum's Outline Series, Tata McGraw Hill","Hayt, W. H., Kemmerly, J. E., and Durbin, S. M., Engineering Circuit Analysis, Tata McGraw Hill ","Hughes, Electrical and Electronic Technology, Pearson Education ","Parker and Smith, Problems in Electrical Engineering, CBS Publishers and Distributors ","Sudhakar and Syam Mohan, Circuits and Networks Analysis and Synthesis, Tata McGraw Hill ","Suresh Kumar, K. S, Electric Circuits and Networks,Pearson Education "],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"Fundamental Concepts of Circuit Elements and Circuit variables:  Electromotive force, potential and voltage. Resistors, Capacitors, Inductors- terminal V-I relations. Basic Circuit Laws: Kirchhoff's current and voltage laws, analysis of resistive circuits - mesh, node analysis, super mesh  and  super  node  analysis.  Star  delta  transformation. Numerical problems. ","hours":6}]},{"module":2,"mark percentage":15,"contents":[{"content":"Magnetic Circuits: Magneto motive force, flux, reluctance, permeability comparison of electric and magnetic circuits analysis of series and parallel magnetic circuits, magnetic circuits with air-gaps.Electromagnetic Induction: Faraday’s laws, Lenz’s law, statically and dynamically induced emf, self and mutual inductance, coupling  coefficient. Real and Ideal independent voltage and current sources, V-I relations. Passive  sign convention. Numerical problems. ","hours":9}]},{"module":3,"mark percentage":15,"contents":[{"content":"Alternating  current  fundamentals: Frequency, Period, RMS and average values, peak factor and form factor of periodic waveforms (pure sinusoidal and composite  waveforms). Phasor Concepts, Complex representation(exponential, polar and rectangular forms) of sinusoidal voltages and currents, phasor diagrams, Complex impedance -  series and parallel impedances and admittances. Phasor analysis of RL, RC, RLC circuits. Numerical problems. ","hours":9}]},{"module":4,"mark percentage":15,"contents":[{"content":"Complex Power: Concept of power factor -active, reactive power and apparent power. Resonance  in series and parallel circuits: Energy, bandwidth and quality factor, variation of impedance and admittance in series and parallel resonant circuits. Numerical problems. ","hours":5}]},{"module":5,"mark percentage":20,"contents":[{"content":"Three-phase systems: Star and delta connections, three-phase three wire and three-phase four-wire systems, analysis of balanced and unbalanced star and delta connected loads, power in three-phase circuits. Active and Reactive power measurement by one, two, and three wattmeter methods.Numerical problems. ","hours":8}]},{"module":6,"mark percentage":20,"contents":[{"content":"Wiring systems: Basic concepts of wiring (conduit wiring only), service mains, meter board and  distribution board. Earthing: Earthing of installations - necessity of earthing, plate &  pipeearthing. Protective devices: protective fuses, MCB, ELCB. ","hours":5}]}
    ]},
    {"Subject":"Introduction to Eletronic Engineering","code":"BE101-04","LTP":"2-1-0-3","Course Objectives":".1.To get basic idea about types, specification and common values of passive components 2.To familiarize the working and characteristics of diodes, transistors and MOSFETS 3.To understand working of diodes in circuits and in rectifiers 4.To familiarize some measuring instruments","index":"Evolution and  Impact of Electronics, Familiarization of  Resistors, Capacitors, Inductors, Transformers and Electro mechanical components, Semiconductors, PN junction diode, Zener diode, LED, photo diode, Bipolar Junction Transistors: Structure, principle of operation, different configurations, load line and operating point, biasing and stabilization, Transistor as amplifier, switch, Junction Field Effect  Transistors: Structure, principle of operation,characteristics MOSFET: Structure, principle of operation, characteristics,Principle of operation of Photo transistor, UJT, SCR,Diode circuits and power supplies: Series and parallel diode circuits, Half-wave & full wave rectifier, capacitor filter, zener voltage regulator, Electronic Measurements and measuring  Instruments: Performance parameters, Analog and digital multimeter, CRO, DSO, function generator, Testing of Electronic components. ","Expected outcome":"Student can identify the active and passive electronic components and can design and setup simple circuits  using  diodes  and  transistors. Voltage and currents can be  measured and monitored using electronic measuring instruments ","References":["Bell, D. A., Electronic Devices and Circuits, Oxford University Press ","Boylested, R. L. and Nashelsky,L.,Electronic Devices and Circuit Theory, Pearson Education ","Kal, S., Basic Electronics: Devices, Circuits and its Fundamentals, PHI Learning ","Millman, J., Halkias, C. and Parikhu,C. D.,Integrated Electronics, Tata Mc Graw Hill ","Neaman, D. A., Electronic Circuits Analysis and Design, McGraw Hill ","Sedra, A. S. and Smith, K. C., Microelectronic Circuits, Oxford University Press  "],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"Evolution of Electronics, Impact of Electronics in industry and in society. ","hours":1},{"content":"Resistors, Capacitors: types, specifications.  Standard values, marking, colour coding.  ","hours":3},{"content":" Inductors and Transformers: types, specifications,Principle of working. ","hours":2},{"content":"Electro mechanical components: relays and contactors.","hours":1}]},{"module":2,"mark percentage":15,"contents":[{"content":"Diodes: Intrinsic and extrinsic semiconductors, PN junction diode, barrier potential, V-I characteristics, Effect of temperature. Equivalent circuit of a diode. Piece wise linear model. ","hours":3},{"content":"Specification parameters of diodes and numbering. ","hours":1},{"content":"Zener diode, Varactor diodes, characteristics, working principle of LED, photo diode, solar cell. ","hours":3}]},{"module":3,"mark percentage":15,"contents":[{"content":"Bipolar  Junction  Transistors: Structure, typical doping,  Principle of operation, concept of different configurations. Detailed study of input and output characteristics of common base and common emitter configuration, current gain, comparison of three configurations.","hours":3},{"content":"Concept of load line and operating point.Need  for biasing and stabilization, voltage divider  biasing, Transistor as amplifier, switch, RC coupled amplifier and frequency response ","hours":3},{"content":"Specification parameters of transistors and type numbering ","hours":1}]},{"module":4,"mark percentage":15,"contents":[{"content":"Junction Field Effect  Transistors: Structure, principle of operation, characteristics, comparison with BJT.","hours":2},{"content":"MOSFET: Structure, principle  of operation of Enhancement type MOSFET, Current voltage characteristics, Depletion-type MOSFET","hours":2},{"content":"Principle of operation of Photo transistor, UJT, SCR. ","hours":3}]},{"module":5,"mark percentage":20,"contents":[{"content":"Diode circuits and power supplies: Series and parallel diode circuits, Clippers, Clampers, Voltage multipliers ","hours":3},{"content":"","hours":2},{"content":"Half-wave and full wave (including bridge) rectifiers,  Derivation of Vrms,Vdc,ripple factor, peak  inverse  voltage, rectification efficiency in  each case, capacitor filter, working and  design of a simple zener voltage regulator. Block diagram description of a DC Power supply, Principle of SMPS ","hours":4}]},{"module":6,"mark percentage":20,"contents":[{"content":"Electronic Measurements and measuring Instruments","hours":2},{"content":"Generalized  performance  parameters  of  instruments: error, accuracy, sensitivity, precision and resolution. Principle and block diagram of  analog and digital multimeter, Block diagram of CRO, Measurements using CRO, Lissajous patterns, Principle and block diagram of DSO, function generator.","hours":4},{"content":"Testing of Electronic components. ","hours":1}]}
    ]},
    {"Subject":"Introduction to Computing and Problem Solving","code":"BE101_05","LTP":"2-1-0-3","Course Objectives":"1.To learn basics of digital computers 2.To develop problem solving skills 3.To learn programming and to solve problems using computers","index":"Introduction to digital computer, Introduction to programming languages, Operating systems, Problem Solving  strategies,  Examples  for  algorithms  and  flow charts, Introduction to Python language, functions, parameters and arguments, Boolean Expressions, logical operators and control statements,Strings, lists,tuples and dictionaries, operations, Files, introduction  to  objects, attributes and instances","Expected outcome":"1.Ability to design algorithmic solution to problems.2.Ability to convert algorithms to Python programs. 3.Ability to design modular Python programs using functions 4.Ability  to  design  programs  with  Interacive  Input and Output, utilizing arithmetic expression repetitions, decision making, arrays. 5.Ability to design programs using file Input and Output. 6.Ability to develop recursive solutions. ","Text Book":["Downey, A. et al., How to think like a Computer Scientist: Learning with Python, John Wiley, 2015 ","Goel, A., Computer Fundamentals, Pearson Education","Lambert K. A., Fundamentals of Python - First Progrms, Cengage Learning India, 2015","Rajaraman, V., Computer Basics and C Programming, Prentice-Hall India "],"References":["Barry, P., Head First Python,, O’ Reilly Publishers ","Dromy, R. G., How to solve it by Computer, Pearson India ","Guzdial,  M. J., Introduction to Computing and Programming in Python, Pearson India ","Perkovic, L., Introduction to Computing Using Python, 2/e, John Wiley, 2015","Sprankle ,  M., Problem Solving & Programming Concepts, Pearson  India ","Venit, S. and Drake, E., Prelude to Programming: Concepts & Design, Pearson India ","Zelle, J., Python Programming: An Introduction to Computer Science, Franklin, Beedle & Associates Inc. "],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"Introduction  to  digital  computer–Von  Neumann concept –A simple model of computer, acquisition of data, storage of data, processing of data, output of processed data. Details of functional units of a computer. Storage – primary storage and secondary storage. (The  discussion should focus more on the  functionalities of the units and their interaction than on specific hardware details. However, concepts like memory cells and their addressability (need not be binary), registers, inter-connections(buses)  have to introduced  at an abstract level. For storage devices  – primary  and  secondary  –,  various  categories  have to be introduced  along with their  distinguishing features. For I-O devices also, various categories are to be introduced. The Von Neumann concept should be effectively introduced. History computers need not be taught. However, students have to be encouraged to read the  relevantsections of the text book. Chapters 1 – 4 of ‘Goel’ may be used to support teaching -learning.Introduction to programming  languages:- types of programming languages - high level language , assembly language and machine language, System software - Operating systems –  objectives of operating systems, compiler, assembler and interpreter.(For all the above  topics, focus should be more on the concepts, significance and objectives. Chapter 6 and 7 (up to 7.4) of ‘Goel’ may be used to support the teaching-learning process.))","hours":8}]},{"module":2,"mark percentage":15,"contents":[{"content":"Problem  Solving  strategies –Problem analysis – formal definition of problem – Solution – top- down design – breaking a problem into sub problems- overview of the solution to the sub problems by writing step by step procedure (algorithm) - representation of  procedure by flowchart - Implementation of  algorithms  –  use of procedures to achieve  modularity.(For this part the instructor has to initially use suitable analogies of real world  problems to explain the concepts, before delving  into  computer-solvable problems.) Examples for algorithms and flow charts - at least 10 problems (starting with non-numerical examples, and numeric problems like factorial, largest among three numbers, largest among N, Fibonacci etc.; to be introduced with progressive levels  of difficulty) must be discussed in detail. (Class assignments and/or tutorials may be  used  to strengthen understanding of this  part.  Chapters  4  and  5  of  the  ‘Rajaraman’  may be used for the teaching-learning process.)","hours":8}]},{"module":3,"mark percentage":15,"contents":[{"content":"Introduction to Python–variables, expressions and statements, evaluation of expressions, precedence, string operations (Note:- the instructor can demonstrate simple programs to the students and encourage them to develop similar ones. In particular, before attempting programs containing functions, the students should be given enough support and time to develop python code containing long sequence of statements for  the simple flowcharts developed earlier. This  will strengthen the students’ understanding of instruction sequencing. Chapters 1 and 2 of ‘Downey’ have to be covered. Chapter 1 &2 of ‘Lambert’ can also be used.) Control statements,  Boolean expressions and logical operators,  conditional and alternative executions (Note:  -  Chapter 4 of ‘Downey’ up to Section 4.9 has to  be covered. The instructor should demonstrate  each of these concepts with real examples and  encourage students to develop as many as possible. Chapter 3 of ‘Lambert’ can be used for detailed discussion and self-study) Iteration - while statement and tables. (Note: - Chapter 6 of ‘Downey’ has to be covered.Chapter 3 of ‘Lambert’ can be used for detailed discussion and self-study.)","hours":8}]},{"module":4,"mark percentage":15,"contents":[{"content":"Functions, calling functions,type conversion and coercio, composition of functions, mathematical functions, user-defined functions, parameters and arguments. (Note: - Chapter 3 of ‘Downey’ has to be covered. The instructor should demonstrate each aspect of the function with real examples and encourage students to develop their own. Chapter 6 (up to 6.3) of ‘Lambert’ can be used for detailed discussion and self-study.) ","hours":6}]},{"module":5,"mark percentage":20,"contents":[{"content":"Strings and lists – string traversal and comparison with examples.  (Note: - Chapter 7 of ‘Downey’ has to be covered. Section 4.1 of ‘Lambert’ can be used for detailed discussion and self-study.) List operations with examples (Note: - Chapter 8 of  ‘Downey’ up to Section 8.6 has to be covered.  Section 5.1 of ‘Lambert’ can be used for detailed discussion and self-study.); tuples  and dictionaries – operations and examples(Note:  - Chapters 9 & 10 of the third text have to be  covered. Section 5.4 of ‘Lambert’ can be used for detailed discussion and self-study.)","hours":6}]},{"module":6,"mark percentage":20,"contents":[{"content":"Files and exceptions - text files, directories (Note: - Chapter 11 of ‘Downey’ has to be covered)Introduction to classes and objects - attributes, instances  (Note: - Chapter 12 of ‘Downey’ up to Section 12.6 has to be covered)","hours":6}]}
    ]},
    
    {"Subject":"Introduction to Chemical Engineering","code":"BE101-06","LTP":"2-1-0-3","Course Objectives":"1.To instil in students the  interest, excitement, and urge to learn the  subject of Chemical Engineering 2.To introduce the profession of Chemical Engineering 3.To introduce the purpose of learning important subjects in Chemical Engineering for meeting the requirement of various professional fields in Chemical Engineering.","index":"Introduction  to Chemical Engineering, profession, plant operation, Basic concepts of units and equations of state, Overview of unit operations and processes, Modes of heat transfer, chemical reactions, DCDA process, basic concepts of P&I diagram. Introduction to process instrumentation and control, Introduction to safety in chemical process industries, introduction to Environmental Engineering, Challenges of Chemical Engineer, Introduction to novel materials and their development. ","Expected outcome":"The student will demonstrate the ability to underst and the basic concepts of Chemical Engineering","References":["Badger and Banchero, Introduction to Chemical Engineering, McGraw Hill ","McCabe, W. L., Smith, J.C. and Harriott, P., Unit Operations in Chemical Engineering, McGraw Hill","Pushpavanam, S., Introduction to Chemical Engineering, PHI Learning Pvt. Ltd. ","Smith, R., Chemical Process Design and Integration,Wiley"],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"Introduction to Chemical Engineering: history of Chemical Engineering, role of Chemical Engineering– a broad overview; chemical industries in India; introduction to  Chemical Engineering profession; introduction  to chemical plant operation; process development and process design. ","hours":6}]},{"module":2,"mark percentage":15,"contents":[{"content":"Basic concepts: units and dimensions, systems of units, conversion and conversion factors of units, concept of mole, weight percent, mole percent, normality, molarity, molality, vapor pressure, partial pressure, concept of ideal gas and equations of state. ","hours":7}]},{"module":3,"mark percentage":15,"contents":[{"content":"Overview of unit operations such as distillation, evaporation, absorpt adsorption, extraction, crystallization, drying, leaching, size separation and size reduction. Overview of unit processes like saponification, polymerization, biodiesel formation and hydrogenation. ","hours":8}]},{"module":4,"mark percentage":15,"contents":[{"content":"Modes of heat transfer-principles of conduction, convection and radiation,heat exchangers. Fluid flow- laminar and turbulent flow. Introduction to transportation of fluids. Classification of  chemical reactions, order of reaction, rate  equation, Arrhenius equation, conversion and yield, batch reactor, mixed reactor and plug flow reactor. ","hours":8}]},{"module":5,"mark percentage":20,"contents":[{"content":"Block  diagram, process flow diagram for DCDA process  for Sulphuric acid manufacture, basic concepts of P&I diagram. Introduction to process instrumentation and control: common  methodologies of measurements, measuring  instruments: thermocouple, venturimeter, U-tube manometer, elements of feedback control loop, introduction to control of a distillation column. ","hours":7}]},{"module":6,"mark percentage":20,"contents":[{"content":"Introduction to safety in chemical process industries – basic concepts, Case study: Bhopal gas tragedy.  Introduction to Environmental Engineering - basic concepts, Typical wastewater, air and solid waste management system.Case study: Effect of Aerial Spraying of Endosulfan on Residents of Kasargod, Kerala. Challenges of Chemical Engineer –need for sustainable alternatives for processes; products with environment friendly life-cycle. Introduction to novel materials and their development. ","hours":6}]}
    ]},
    
     {"Subject":"Introduction to Substainable Engineering","code":"BE103","LTP":"2-1-0-3","Course Objectives":"To have an increased awareness among students on issues in areas of sustainability. To understand the role of engineering and technology within sustainable development;To know the methods, tools, and incentives for sustainable product-service  system development. To establish a clear understanding of the role and impact of various aspects of engineering and engineering decisions on environmental, societal, and economic problems. ","Index":"Sustainability- need and concept, challenges, Environment acts and protocols, Global, Regional and Local environmental issues, Natural resources and their pollution, Carbon credits, Zero waste concept ISO  14000, Life Cycle Analysis,  Environmental Impact Assessment studies,  Sustainable  habitat, Green buildings, green  materials, Energy, Conventional and renewable  sources, Technology and sustainable development, Sustainable urbanization, Industrial Ecology. ","Expected outcome":"The student will be Able to understand the different types of environmental pollution problems and their sustainable solutions. Able to work in the area of sustainability for research and education.Having a broader perspective in thinking for sustainable practices by utilizing the engineering knowledge and principles gained from this course ","References":["Allen, D. T.and Shonnard, D. R., Sustainability Engineering: Concepts, Design and Case Studies, Prentice Hall.","Bradley.  A.S; Adebayo,A.O.,  Maria, P. Engineering applications in sustainable design and development, Cengage learning ","Environment Impact Assessment Guidelines, Notification of Government of India, 2006  ","Mackenthun, K.M., Basic Concepts in Environmental Management, Lewis Publication, London, 1998 ","ECBC  Code  2007, Bureau of  Energy Efficiency, New Delhi Bureau of Energy  Efficiency Publications-Rating System, TERI Publications - GRIHA Rating System ","Ni bin  Chang, Systems Analysis for Sustainable Engineering: Theory and Applications, McGraw-Hill Professional. ","Twidell, J. W. and Weir, A. D., Renewable Energy Resources, English Language Book Society (ELBS). ","Purohit, S. S., Green Technology - An approach for sustainable environment, Agrobios publication  "],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"Sustainability  -  Introduction, Need and concept of sustainability, Social- environmental and   economic sustainability concepts.Sustainable development, Nexus between Technology and  Sustainable development, Challenges for  Sustainable  Development. Multilateral  environmental agreements and Protocols - Clean Development Mechanism (CDM), Environmental legislations in India - Water Act, Air Act. ","hours":"L4"},{"content":"Students may be assigned to do at least one project eg: a)  Identifying/assessment of sustainability in  your neighbourhood in education, housing, water resources, energy resources, food supplies, land use, environmental protection etc. b)  Identify the threats for sustainability in any selected  area  and  explore solutions for the same","hours":"P1"}]},{"module":2,"mark percentage":15,"contents":[{"content":"Air Pollution, Effects of Air Pollution; Water pollution- sources, Sustainable wastewater treatment, Solid waste - sources, impacts of solid waste, Zero waste  concept, 3 R concept. Global environmental issues- Resource degradation, Climate change, Global warming,  Ozone layer depletion, Regional and Local  Environmental Issues. Carbon credits and  carbon trading, carbon foot print.","hours":"L6"},{"content":"Students may be assigned to do at least one project for eg: a) Assessing the pollution status of a small area. b) Programmes for enhancing public environmental awareness. c) Observe a pond nearby and think about the different measures that can be adopted for its conservation ","hours":"P3"}]},{"module":3,"mark percentage":15,"contents":[{"content":"Environmental management  standards, ISO 14000 series, Life Cycle Analysis (LCA) - Scope and Goal, Bio-mimicking Environment Impact Assessment (EIA) -Procedures of EIA in India. ","hours":"L4"},{"content":"Students may be assigned to do at least one project eg: a) Conducting LCA of products (eg. Aluminium cans, PVC bottles, cars etc. or activities (Comparison of land filling and open burning). b) Conducting an EIA study of a  small project (eg. Construction of a building)","Hours":"P2"}]},{"module":4,"mark percentage":15,"contents":[{"content":"Basic concepts of sustainable habitat, Green buildings, green materials for building construction, material  selection for sustainable design, green building certification, Methods for increasing energy efficiency of buildings. Sustainable cities, Sustainable transport. ","hours":"L5"},{"content":"Students may be assigned to do at least one project eg: a) Consider the design aspects of a sustainable building for your campus b) Explore the different methods that  can be adopted for maintaining a sustainable transport system in your city. ","hours":"P2"}]},{"module":5,"mark percentage":20,"contents":[{"content":"Energy sources: Basic concepts-Conventional and non-conventional,  solar energy, Fuel cells, Wind energy, Small  hydro plants, bio-fuels, Energy derived from oceans, Geothermal energy. ","hours":"L5"},{"content":"Students may be assigned to do at least one project eg: a) Find out the energy savings that can be achieved by the installation of a solar water heater. b) Conduct a feasibility study for the installation of wind mills in Kerala ","hours":"P2"}]},{"module":6,"mark percentage":20,"contents":[{"content":"Green Engineering, Sustainable Urbanisation, industrialisation and poverty reduction; Social and technological  change, Industrial Processes: Material selection, Pollution Prevention, Industrial Ecology, Industrial symbiosis. ","hours":"L5"},{"content":"Students may be assigned to do a group project eg: a) Collect details for instances of climate change in your locality b) Find out the carbon credits you can gain by using a sustainable transport system(travelling in a cycle or car pooling from college to home) c) Have a debate on the topics like: Industrial Ecology is a Boon or Bane for Industries?/Are  we scaring the people on Climate Change unnecessarily?/Technology  enables  Development sustainable or the root cause of unsustainability? ","hours":"P3"}]}
    ]},
    
    {"Subject":"Basics of Civil Engineering","code":"CE100","LTP":"2-1-0-3","Course Objectives":"1.To inculcate  the essentials of Civil Engineering field to  the students of all branches of Engineering. 2. To provide the students an illustration of the significance of the Civil Engineering Profession in satisfying societal needs.","index":"General introduction  to Civil Engineering - Introduction to types ofbuildings, Components of a residential  building, Introduction to industrial buildings; Introduction to planning of residential buildings - Simple building plans; Introduction to the various building area terms; Setting out of a building; Surveying – Principles,Objectives, Horizontal measurements with tapes, Ranging;  Levelling – Instruments, Reduction of levels; Modern surveying instruments; Building materials – Bricks, cement blocks, Cement, Cement mortar, Steel; Building construction – Foundations, Brick masonry, Roofs, Floors, Decorative finishes, Plastering, Paints and Painting; Basic infrastructure andservices – Elevators, Escalators, Ramps, Air conditioning, Sound proofing, Towers, Chimneys, Water Tanks; Intelligent buildings.","Expected outcome":"1.The students will be able to illustrate the fundamental aspects of Civil Engineering. 2.The students will be able to plan and set out a building. 3.Students will be able to explain the concepts of surveying for making horizontal and vertical measurements. 4.They will able to  illustrate the uses of various building  materials and explain the method of construction of different components of a building.5.Students will be able to discuss about various services in a building. ","References":["Chudley, R., Construction Technology, Vol. I to IV,Longman Group, England","Chudley, R. and Greeno, R., Building Construction Handbook, Addison Wesley, Longman Group, England","Gopi, S., Basic Civil Engineering, Pearson Publishers"," Kandya, A. A., Elements of Civil Engineering, Charotar Publishing house","Mamlouk, M. S., and Zaniewski, J. P., Materials for Civil and Construction  Engineering,Pearson Publishers ","McKay  W. B.  and McKay, J. K., Building Construction Volumes1 to 4, Pearson India Education Services","Minu, S., Basic Civil Engineering, Karunya Publications","Rangwala, S. C., Essentials of Civil Engineering, Charotar Publishing House","Rangwala, S. C. and Dalal, K. B., Engineering Materials, Charotar Publishing house","Rangwala, S. C. and Dalal, K. B., Building Construction, Charotar Publishing house "],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"General Introduction to Civil Engineering - Various disciplines of Civil engineering, Relevance of Civil engineering in the overall infrastructural development of the country.","hours":2},{"content":"Introduction  to types of buildings as per NBC; Selection of  site for buildings. ","hours":3},{"content":"Components of a residential building and their functions. Introduction to industrial buildings– office / factory / software development office  / power house /electronic equipment service  centre (any one related to the branch of study) ","hours":2},{"content":"Students have to visit one such building and submit an assignment about the features of any one of the listed building related to their branch (Not included for exam). ","hours":1}]},{"module":2,"mark percentage":15,"contents":[{"content":"Building planning - Introduction to planning of residential buildings- Site plan, Orientation of a building,Open space requirements, Position of doors and windows, Size of rooms; Preparation of a scaled sketch of the plan of a single storeyed residential building in a given site plan.  ","hours":4},{"content":"Introduction to the  various building area terms - Computation of  plinth area / built up area, Floor area / carpet area - for a simple single storeyed building; Setting out of a building. ","hours":3}]},{"module":3,"mark percentage":15,"contents":[{"content":"Surveying - Principles and objectives of surveying;","hours":1},{"content":"Horizontal measurements  – instruments used  – tape, types of tapes; Ranging (direct ranging only) – instruments used for ranging. ","Hours":3},{"Content":"Levelling - Definitions,  principles, Instruments (brief discussion only)- Level field book - Reduction of levels - problems on levelling (height of collimation only). ","hours":3},{"content":"Modern surveying instruments – Electronic distance meter, digital level, total station, GPS (Brief discussion only). ","hours":1}]},{"module":4,"mark percentage":15,"contents":[{"content":"Building materials - Bricks, cement blocks - Properties and specifications. ","hours":2},{"content":"Cement – OPC, properties, grades; other types of cement and its uses (in brief). ","hours":1},{"content":"Cement mortar – constituents, preparation.","hours":1},{"content":"Concrete – PCC and RCC – grades.","hours":1},{"content":"Steel - Use of steel in building construction, types and market forms. ","hours":1}]},{"module":5,"mark percentage":20,"contents":[{"content":"Building construction – Foundations; Bearing capacity of soil (definition only); Functions of foundations, Types - shallow and deep (sketches only). ","hours":2},{"content":"Brick masonry – header and stretcher bond, English bonds – Elevation and plan (one brick thick walls only). ","hours":2},{"content":"Roofs – functions, types, roofing materials (brief discussion only). ","hours":1},{"content":"Floors – functions, types; flooring materials (brief discussion only). ","hours":1},{"content":"Decorative finishes – Plastering – Purpose, procedure. ","hours":1},{"contents":"Paints and Painting – Purpose, types, preparation of surfaces for painting (brief discussion only). ","hours":2}]},{"module":6,"mark percentage":20,"contents":[{"content":"Basic  infrastructure  and  services - Elevators, escalators, ramps, air conditioning, sound proofing  (Civil engineering aspects only) ","hours":2},{"content":"Towers, Chimneys, Water tanks (brief discussion only). ","hours":1},{"content":"Concept of intelligent buildings.","hours":1}]}
    ]},
    
    {"Subject":"Basics of Mechanical Engineering","code":"ME100","LTP":"2-1-0-3","Course Objectives":"To expose the students to the thrust areas in Mechanical Engineering and their relevance by covering the fundamental concepts","index":"Thermodynamics, laws of thermodynamics, implications, cycles, energy conversion devices, steam and water machines, engines, turbo machines, refrigeration and air conditioning, power transmission devices in  automobiles, latest trends, engineering materials  and  manufacturing  processes, types of materials, alloys, shape forming methods, machine tools.  ","Expected outcome":"The student will be able to understand the inter dependence of the thrust areas in Mechanical Engineering and their significance leading to the development of products, processes and systems.  ","References":["Balachandran, Basic Mechanical Engineering, Owl Books","Benjamin, J., Basic Mechanical Engineering, Pentex Books","Clifford, M., Simmons, K. and Shipway, P., An Introduction to Mechanical Engineering Part I - CRC Press","Crouse, Automobile Engineering, Tata Mc-Graw-Hill, New Delhi","Gill, Smith and Zuirys, Fundamentals of IC Engines,Oxford and IBH publishing company Pvt. Ltd. New Delhi. Crouse, Automobile Engineering Tata Mc-Graw-Hill, New Delhi.","Nag, P. K., Basic and Applied Thermodynamics, Tata McGraw-Hill","Pravin Kumar, Basic Mechanical Engineering","Roy and Choudhary, Elements of Mechanical Engineering, Media Promoters & Publishers Pvt. Ltd., Mumbai.","Sawhney, G. S., Fundamentals of Mechanical Engineering, PHI"],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"Thermodynamics: Laws of Thermodynamics,    significance and applications of laws of  thermodynamics; entropy, available energy; Clausius inequality; principle of increase of entropy; Ideal and real gas equations; Analysis of Carnot cycle, Otto cycle , Desel cycle and Brayton cycle; Efficiency of these cycles.  ","hours":7}]},{"module":2,"mark percentage":15,"contents":[{"content":"Energy  conversion  devices: Boilers, Steam turbines,Gas turbines  and Hydraulic turbines; Working principle of two stroke and four stroke I.C. Engines (Diesel and Petrol), Reciprocating and centrifugal pumps, rotary pumps, reciprocating and centrifugal  compressors, fans, blowers, rotary compressors; Air motor. ","hours":7}]},{"module":3,"mark percentage":15,"contents":[{"content":"Refrigeration and Air Conditioning: Vapour compression and absorption refrigeration  systems, COP, Study of household refrigerator,  Energy Efficiency Rating, Psychrometry,  Psychrometric processes, window air conditioner, split air conditioner. Ratings and selection criteria of above devices. Refrigerants and their impact on environment. ","hours":7},{"content":"Engines and Power Transmission Devices in Automobiles, Different types of engines used in automobiles, types of automobiles; major components and their  functions  (Description  only); Fuels; Recent  developments: CRDI, MPFI, Hybrid engines.  Belts and belt drives; Chain drive; Rope drive; Gears and gear trains; friction clutch (cone and single plate), brakes types and applications only); Applications of these devices. ","hours":7}]},{"module":4,"mark percentage":15,"contents":[{"content":"Engines and Power Transmission Devices in Automobiles, Different types of engines used in automobiles, types of automobiles; major components and their  functions (Description  only);  Fuels;  Recent  developments: CRDI, MPFI, Hybrid engines.  Belts and belt drives; Chain drive; Rope drive; Gears and gear trains; friction clutch (cone and single plate), brakes (types and applications only); Applications of these devices. ","hours":7}]},{"module":5,"mark percentage":20,"contents":[{"content":"Materials and   manufacturing processes: Engineering materials, Classification, properties, Alloys and their  Applications; Casting, Sheet metal forming,  Sheet metal cutting, Forging, Rolling, Extrusio, Metal joining processes - Powder metallurgy.  ","hours":7}]},{"module":6,"mark percentage":20,"contents":[{"content":"Machine Tools (Basic  elements, Working principle and types of operations) Lathe – Centre Lathe, Drilling  Machine – Study of Pillar drilling machine,  Shaper, planer, slotter, Milling Machine,  Grinding machine, Power saw; Introduction to NC and CNC machines.","hours":7}]}
    ]},
    
    {"Subject":"Basics of Electrical Engineering","code":"EE100","LTP":"2-1-0-3","Course Objectives":"To impart a basic knowledge in  Electrical Engineering with an understanding of fundamental concepts. ","index":"Elementary  concepts of electric circuits, Kirchhoff’s  laws, constant voltage and current sources, Matrix  representation; Magnetic circuits, energy stored in magnetic circuits, Electromagnetic induction, Alternating current fundamentals; AC Circuits,  Phasor representation of alternating quantities- rectangular, polar and exponential forms; Three phase systems, star and delta connection; Generation of power, Power transmission and distribution; Transformers, Electric Machines- D.C. Machines, AC Motors; Tariff, Wiring systems, Lamps.","Expected outcome":"The course will enable the students to gain preliminary knowledge in basic concepts of Electrical Engineering. ","References":["Bhattacharya, S. K., Basic Electrical & Electronics Engineering, Pearson","Bird, J., Electrical Circuit Theory and Technology,Routledge, Taylor & Francis Group","Del Toro, V., Electrical Engineering Fundamentals, Prentice Hall of India.","Hayt, W. H., Kemmerly, J. E., and Durbin, S. M., Engineering Circuit Analysis, Tata McGraw Hill ","Hughes, Electrical and Electronic Technology, Pearson education","Mehta, V. K. and Mehta, R., Basic Electrical Engineering, S. Chand Publishing","Parker and Smith, Problems in Electrical Engineering, CBS Publishers and Distributors","Sudhakar and Syam Mohan, Circuits and Networks Analysis and Synthesis, Tata McGraw Hill","Suresh Kumar, K. S, Electric Circuits and Networks,Pearson Education" ],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"Elementary concepts of electric circuits: Kirchhoff’s laws, constant voltage and current sources, formation of network equations by node voltage and mesh current methods. Matrix representation - solution of network equations by matrix methods, star-delta conversion(Analysis of resistive networks only).Numerical problems. ","hours":6}]},{"module":2,"mark percentage":15,"contents":[{"content":"Magnetic circuits: MMF, field strength, flux density,  reluctance, energy stored in magnetic circuits. Electromagnetic induction: Faraday’s laws,Lenz’s law-statically induced and dynamically Induced  emfs- self-inductance and mutual inductance, coefficient of coupling. Alternating current  fundamentals: Generation of alternating  voltages, waveforms frequency, period, average  and RMS values and form factor. Numerical problems.  ","hours":9}]},{"module":3,"mark percentage":15,"contents":[{"content":"AC  Circuits: Phasor representation of alternating  quantities- rectangular, polar and exponential  forms. Analysis of simple ac circuits  - concept of impedance. Power and power factor in ac circuits- active, reactive and apparent power. Solution of RL, RC and RLC circuits. Three  phase systems: Generation of three phase voltages- advantages of three phase systems,  star and delta connection, three wire and four  wire systems, relation between line and phase voltages, line and phase currents. Three phase  power measurement by two wattmeter method.  Numerical problems","hours":9}]},{"module":4,"mark percentage":15,"contents":[{"content":"Generation of power: Block schematic representationof generating stations- hydroelectric, thermal and nuclear power plants. Renewable energy sources. Power transmission and distribution: Typical electrical power transmission scheme, need for high voltage transmission, substation equipments, primary and secondary transmission and distribution systems. ","hours":5}]},{"module":5,"mark percentage":20,"contents":[{"content":"Transformers:  construction of single phase and three phase  transformers(core type only) – EMF equation, losses and efficiency. Electric  Machines:  D.C.  Machines - Construction, types, principles of operation of dc motor, applications. AC Motors - Construction, principles of operation of single phase and three phase induction motor. Principle of operation of Universal motor. ","hours":7}]},{"module":6,"mark percentage":20,"contents":[{"content":"Tariff: Different types of LT and HT consumers, tariff schemes - uniform tariff and differential tariff. Wiring systems: Basic  concepts of wiring (conduit wiring  only),  service mains, meter board and distribution  board. Earthing of installations  - necessity of earthing, plate & pipe earthing, protective fuses, MCB, ELCB.Lamps: Different types of lamps - Incandescent lamps, fluorescent, mercury vapour, sodium vapour, metal halide and LED lamps. ","hours":6}]}
    ]},
    
    {"Subject":"Basics of Eletronics Engineering","code":"Ec100","LTP":"2-1-0-3","Course Objectives":"1.To get basic idea about types, specification and common values of passive components. 2.To familiarize the working and characteristics of diodes, transistors, MOSFETS and some measuring instruments.   3.To understand working of diodes in circuits and in rectifiers. ","index":"Evolution and Impact of Electronics in industries and  in  society,  Familiarization of Resistors, Capacitors,  Inductors, Transformers and Electro mechanical components, PN Junction diode: Structure,  Principle of operation, Photo diode, LED, Solar cell, Bipolar Junction Transistors: Structure, Principle of operation, characteristics, Rectifiers and power supplies: Half wave and full wave rectifier, capacitor filter, zener voltage regulator, Amplifiers and Oscillators: common emitter amplifier, feedback, oscillators, RC phase shift oscillator, Analogue Integrated circuits: operational amplifier, inverting and  non-inverting amplifier, comparator, Electronic Instrumentation: digital multimeter, digital storage oscilloscope, function generator, Radio communication: principle of AM & FM, super heterodyne receiver, Radar system: Principle, block diagram of pulsed radar, Satellite communication: geo-stationary satellite,  transponder, Global Positioning System, Mobile communication: cellular communications, cells, GSM,Optical communication: system, principle of light transmission through fiber, Entertainment Electronics: Color television, cable TV, CCTV system, HDTV, LCD & LED displays. ","Expected outcome":"Student can identify the active and passive electronic components. Student can setup simple circuits using diodes and transistors. Student will get fundamental idea about basic communication systems and entertainment electronics. ","References":["Bell, D. A., Electronic Devices and Circuits, Oxford University Press","Boylested, R. L. and  Nashelsky, L., Electronic Devices and Circuit  Theory, Pearson Education","Frenzel, L. E., Principles of Electronic Communication Systems, Mc Graw Hill","Kennedy, G. and Davis, B., Electronic Communication Systems, Mc Graw Hill  ","Tomasy, W., Advanced Electronic Communication system, PHI Publishers"],"modules":[{"module":1,"mark percentage":10,"contents":[{"content":"Evolution of Electronics, Impact of Electronics in industry and in society","hours":1},{"content":"Resistors, Capacitors: types,  specifications. Standard  values,  marking,colour coding. ","hours":3},{"contents":"Inductors and Transformers: types, specifications,Principle of working. ","hours":2},{"contents":"Electro mechanical components: relays and contactors","hours":1}]},{"module":2,"mark percentage":20,"contents":[{"content":"PN Junction diode: Intrinsic and extrinsic semiconductors, Principle of operation, V-I characteristics, principle of working of Zener diode, Photo diode, LED and Solar cell.  ","hours":3},{"content":"Bipolar Junction  Transistors: PNP and NPN structures, Principle  of operation, input and output characteristics  of common emitter configuration, Typical specifications of low, medium and high power and frequency diodes and transistors, packaging. ","hours":4}]},{"module":3,"mark percentage":15,"contents":[{"content":"Rectifiers and power supplies: Block diagram description of a dc power supply ,Half wave and full wave(including bridge) rectifier, capacitor filter, working of simple zener voltage regulator, Principle of SMPS ","hours":4},{"contents":"Amplifiers and  Oscillators: Circuit diagram and working of  common emitter amplifier, Block diagram of Public Address system, concepts of feedback, working principles of oscillators, circuit diagram & working of RC phase shift oscillator. ","hours":3}]},{"module":4,"mark percentage":15,"contents":[{"content":"Analogue  Integrated  circuits: Functional block diagram of operational amplifier, ideal operational  amplifier, inverting and non inverting amplifier, comparator. ","hours":3},{"content":"Digital ICs: Logic Gates. ","hours":1},{"content":"Electronic Instrumentation: Principle and  block diagram of digital multimeter, principle of digital storage oscilloscope, principle and block diagram of function generator. ","hours":3}]},{"module":5,"mark percentage":20,"contents":[{"content":"Radio communication: principle of AM & FM, frequency bands used for various communication systems, block diagram  of super heterodyne receiver.","hours":3},{"content":"Radar system: Principle, block diagram of pulsed radar.  ","hours":1},{"content":"Satellite communication: concept  of geo-stationary satellite, satellite transponder, advantages, principle of Global Positioning System. ","hours":3}]},{"module":6,"mark percentage":20,"contents":[{"content":"Mobile  communication: basic principles of  cellular communications, concepts of cells, frequency reuse, principle and block diagram of GSM. ","hours":2},{"content":"Optical communication: block diagram of the optical communication system, principle of light transmission through fiber, advantages of optical communication systems. ","hours":2},{"content":"Entertainment and Security  Electronics Technology: Basic principles of cable TV, CCTV, DTH system, HDTV, Plasma, LCD, LED TV","hours":3}]}
    ]},
    
    {"Subject":"Differencial Equtions","code":"MA102","LTP":"3-1-0-4","Course Objectives":"This  course introduces basic ideas of differential equations, both ordinary and partial, which are widely used in the modeling and analysis of a  wide range of physical phenomena and has got applications across all branches of engineering. The course also introduces Fourier series which is used by engineers to represent and analyze periodic functions in terms of their frequency components. ","index":"Homogeneous linear ordinary differential equations, non-homogeneous linear ordinary differential equations, numerical solutions of ordinary differential equations, Fourier series, partial differential equations, applications of partial differential equations. ","Expected outcome":"At the end of the course students will have acquired basic knowledge of differential equations and methods of solving them and their use in analyzing typica  mechanical or electrical systems. The included set of assignments will familiarize  the students with the use of software packages  for analyzing systems modeled by differential equations. ","Text Book":["Kreyszig, E., Advanced Engineering Mathematics, Wiley","Srivastava, A. C. and Srivasthava, P. K., Engineering Mathematics, Vol 2. PHI Learning Pvt. Ltd." ],"References":["Bali, N. P. and Goyal, M., Engineering Mathematics,Lakshmy Publications","Datta, Mathematical Methods for Science and Engineering. Cengage Learning","Edwards,  C.  H.  and  Penney,  D.  E.,  Differential  Equations  and  Boundary  Value  Problems. Computing and Modelling, Pearson.","Grewal, B. S., Higher Engineering Mathematics, Khanna Publishers, New Delhi.","Jordan, D. W. and Smith, P., Mathematical Techniques, Oxford University Press","Pal, S and Bhunia, S. C., Engineering Mathematics, Oxford, 2015","Ross, S. L., Differential Equations, Wiley "],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"HOMOGENEOUS LINEAR DIFFERENTIAL EQUATIONS (Text Book 1: Sections: 1.7, 2.1, 2.2,2.4,2.6, 3.1,3.2) Existence and Uniqueness theorem for solutions of initial value problems (without  proof). Basic theory of solutions of  homogeneous  differential equation (superposition principle, basis of solutions,  general and particular solutions). ","hours":5},{"content":"Methods of solving homogeneous  linear differential equations with constant  coefficients of orders two or higher. Modelling of free oscillations of a mass-spring system. (For practice and submission as assignment only: Solutions of separable, exact and first order linear differential equations  and orthogonal trajectories ) ","hours":4}]},{"module":2,"mark percentage":20,"contents":[{"content":"NON-HOMOGENEOUS LINEAR ORDINARY DIFFERENTIAL EQUATIONS (Text Book 1: Sections: 2.7—2.10, 3.3) Basic theory of non-homogeneous linear differential equations. Methods of solving non-homogeneous linear differential equations with constant coefficients ","hours":4},{"content":"Method of undetermined coefficients and method  of variation of parameters.   ","hours":4},{"contents":"Legendre and Cauchy’s differential equations. Modelling of forced oscillations of  mass-spring system and electric circuits. (For practice and submission as assignment only: Sketching, plotting and interpretation of solutions of differential equations using suitable software packages) ","hours":2}]},{"module":3,"mark percentage":15,"contents":[{"content":"NUMERICAL SOLUTIONS OF DIFFERENTIAL EQUATIONS (Text Book 1: sections 21.1, 21.2) Basic idea of numerical solutions of differential equations. Euler-method, improved  Euler  method, Runge-kutta method of fourth order (without proof) ","hours":6},{"contents":"Predictor-corrector  method  of  Adams-Moulton (without proof). Error bounds of these methods. (For practice and submission as assignment only: Implementation of the above numerical methods in any programming language or using software packages) ","hours":2}]},{"module":4,"mark percentage":15,"contents":[{"content":"FOURIER SERIES  (Text Book 1: Sections: 11.1-11.2 ) Periodic Functions- Orthogonality of Sine and  Cosine functions-Fourier series of periodic functions, Euler’s formula, Condition for Convergence of Fourier series (without proof)  ","hours":3},{"content":"Fourier series for even and odd functions, Half range expansion (For practice and submission as assignment only: Plots of partial sums of Fourier series and demonstration of convergence using plotting software) ","hours":6}]},{"module":5,"mark percentage":20,"contents":[{"content":"PARTIAL DIFFERENTIAL EQUATION (Text Book 2: Section: 5.1.1, 5.1.2, 5.1.3, 5.1.4, 5.1.5, 5.1.9, 5.1.10, 5.2.6, 5.2.7, 5.2.8, 5.2.9, 5.2.10) Formation of PDEs, solutions of  first order PDEs, General integral, complete integral, Lagrange’s linear equation,  ","hours":5},{"content":"Higher order PDE-Solution of Linear Homogeneous PDE with Constant Coefficients.  ","hours":5}]},{"module":6,"mark percentage":20,"contents":[{"content":"APPLICATIONS OF PARTIAL DIFFERENTIAL EQUATIONS (Text Book 2: Section: 6.1, 6.2, 6.3, 6.4, 6.7, 6. 8, 6. 9, 6.9.1, 6.9.2) Method of Separation of Variables ","hours":2},{"content":"Modelling Vibrations of a Stretched sting-One dimensional wave equation and its Solution by Fourier series. ","hours":4},{"content":"Heat  transfer  through  an  insulated  rod-one dimensional  heat  equation.Solution of heat equation by Fourier series in special cases– insulated rod with ends at zero temperatures, insulated rod  with ends at non-zero temperatures. (For practice and submission as assignment only: Plots of partial sums of Fourier series  solutions of PDEs and demonstration of convergence using plotting software) ","hours":4}]}
    ]},
    
    {"Subject":"Disign and Engineering","code":"BE102","LTP":"2-0-2-3","Course Objectives":"The purpose of this course is:- 1.To excite the student on creative design and its significance; 2.To make the student aware of the processes involvedin design; 3.To make the student understand the interesting interaction of various segments of humanities, sciences and engineering in the evolution of a design; 4.To get an exposure as to how to engineer a design. ","index":"Design and its objectives; Role of science, engineering and technology in design; Engineering as a business proposition; Creative design and the Design Process; Design evaluation and communication of designs;  Design for function and strength; Material  selection and design detailing;  Role  of standards in design Engineering the design;  Design for “X”; Product centered and user  centered design; Aesthetics and ergonomics;  Concepts of value engineering, concurrent  engineering and reverse engineering in design;  Culture based design; Modular design; Design optimization needs; User interface;  Intelligent and autonomous products; Internet  of things; Advanced products and human  psychology; Life cycle design; Product and itsenvironment; Design as a  marketing tool; Products and IPR; Product liability. ","Expected outcome":"The student will be:- 1.Able to appreciate the different elements involved in good designs and to apply them in practice when called for. 2.Aware of the product oriented and user oriented aspects that make the design a success.  3.Will be capable to think of innovative designs incorporating different segments of knowledge gained in the course; 4.Students will have a broader perspective of design covering function, cost, environmental sensitivity, safety and other factors other than engineering analysis. ","References":["Balmer, R. T., Keat, W. D., Wise, G., and Kosky,  P., Exploring Engineerin, Third Edition: An Introduction to Engineering and Design - [Part 3 - Chapters 17 to 27], ISBN-13: 978-0124158917  ISBN-10: 0124158919","Dym, C. L., Little, P. and Orwin, E. J., Engineering Design - A Project based introduction - Wiley, ISBN-978-1-118-32458-5","Eastman, C. M. (Ed.), Design for X Concurrent engineering imperatives, 1996, XI, 489 p. ISBN 978-94-011-3985-4 Springer","Haik, Y. And Shahin, M. T., Engineering Design Process, Cengage Learning, ISBN-13: 978-0-495-66816-9","Pahl, G., Beitz, W., Feldhusen, J. and Grote, K. H., Engineering Design: A Systematic Approach, 3rd ed. 2007, XXI, 617p., ISBN 978-1-84628-319-2","Voland, G., Engineering by Design, ISBN 978-93-325-3505-3, Pearson India "],"modules":[{"module":1,"mark percentage":15,"contents":[{"content":"Design and its objectives; Design  constraints, Design functions, Design means  and Design from; Role of Science, Engineering  and Technology in design; Engineering as a  business proposition; Functional and Strength Designs. Design form, function and strength; ","hours":"L2"},{"content":"How to initiate creative designs? Initiating the thinking process for designing a product of daily use.  Need identification; Problem Statement; Market survey- customer  requirements; Design   attributes and objectives; Ideation; Brain  storming  approaches; arriving at solutions; Closing on to the Design needs. ","hours":"L3"},{"contents":"An Exercise in the process of design initiation. A simple problem is to be taken up to examine different solutions- Ceiling fan? Group Presentation and discussion.","hours":"P4"}]},{"module":2,"mark percentage":20,"contents":[{"content":"Design  process- Different stages in design and their significance; Defining the design space; Analogies and “thinking  outside  of  the  box”; Quality  function deployment-meeting  what   the  customer  wants; Evaluation and choosing of a design. ","hours":"L2"},{"content":"Design Communication; Realization of the concept in to a  configuration, drawing and model. Concept  of “Complex is Simple”. Design for function and strength. Design detailing- Material selection, Design visualisation- Solid modelling;  Detailed 2D drawings; Tolerancing; Use of standard items in design; Research needs in design; Energy needs of the design, both in its realization and in the applications.","hours":"L3"},{"contents":"An exercise in the  detailed design of two products (Stapler/ door/clock) ","hours":"P4"}]},{"module":3,"mark percentage":15,"contents":[{"content":"Prototyping- rapid prototyping; testing and evaluation of design; Design modifications;  Freezing the design; Cost analysis. ","hours":"L2"},{"contents":"Engineering  the  design  –  From  prototype  to  product.Planning; Scheduling; Supply chains; inventory; handling;manufacturing/construction operations; storage; packaging; shipping; marketing; feed-back on design. ","hours":"L3"},{"content":"List out the standards organizations.Prepare a list of  standard items used in any engineering specialization. Develop any design with over  50% standard items as parts.","hours":"P4"}]},{"module":4,"mark percentage":15,"contents":[{"content":"Design for “X”; covering quality,  reliability, safety, manufacturin/construction, assembly, maintenance,logistics, handling; disassembly; recycling; re-engineering etc. List out the design requirements(x) for designing a rocket shell of 3 meter diameter and 8 meter length. ","hours":"L4"},{"content":"Design mineral water bottles that could be  packed compactly for transportation","hours":"P4"}]},{"module":5,"mark percentage":20,"contents":[{"content":"Product centred and user centred design. Product centred attributes  and user centred attributes. Bringing the two closer. Example: Smart phone. Aesthetics and ergonomics. ","hours":"L2"},{"content":"Product centred and user centred design. Product centred attributes and user centred attributes. Bringing the two closer. Example: Smart phone. Aesthetics and ergonomics. ","hours":"L4"},{"contents":"Make sharp corners and change them to smooth curves- check the acceptance.  Examine the possibility of value addition for an existing product.","hours":"P6"}]},{"module":6,"mark percentage":20,"contents":[{"content":"Modular design; Design optimization; Intelligent and autonomous products; User  interfaces; communication between products;  autonomous products; internet of things; human psychology and the advanced products.Design as a marketing tool; Intellectual Property rights – Trade secret; patent; copy-right; trademarks; product liability. ","hours":"L3"},{"content":"Group  presentation  of  any  such  products  covering  all aspects that could make or mar it. ","hours":"P6"}]}
    ]}
    
    
    
    
]}

  
